MikroElektronika/core_packages/dsPIC/XC16/def/PIC24F08KL402/mcu.h
#define _T1CON_T1ECS0_POSITION                   0x00000008
#define _T1CON_T1ECS0_MASK                       0x00000100
#define _T1CON_T1ECS0_LENGTH                     0x00000001

#define _T1CON_T1ECS1_POSITION                   0x00000009
#define _T1CON_T1ECS1_MASK                       0x00000200
#define _T1CON_T1ECS1_LENGTH                     0x00000001

#define _T2CON_T2CKPS_POSITION                   0x00000000
#define _T2CON_T2CKPS_MASK                       0x00000003
#define _T2CON_T2CKPS_LENGTH                     0x00000002

#define _T2CON_TMR2ON_POSITION                   0x00000002
#define _T2CON_TMR2ON_MASK                       0x00000004
#define _T2CON_TMR2ON_LENGTH                     0x00000001

#define _T2CON_T2OUTPS_POSITION                  0x00000003
#define _T2CON_T2OUTPS_MASK                      0x00000078
#define _T2CON_T2OUTPS_LENGTH                    0x00000004

#define _T2CON_TCKPS_POSITION                    0x00000000
#define _T2CON_TCKPS_MASK                        0x00000003
#define _T2CON_TCKPS_LENGTH                      0x00000002

#define _T2CON_TON_POSITION                      0x00000002
#define _T2CON_TON_MASK                          0x00000004
#define _T2CON_TON_LENGTH                        0x00000001

#define _T2CON_TOUTPS_POSITION                   0x00000003
#define _T2CON_TOUTPS_MASK                       0x00000078
#define _T2CON_TOUTPS_LENGTH                     0x00000004

#define _T2CON_T2CKPS0_POSITION                  0x00000000
#define _T2CON_T2CKPS0_MASK                      0x00000001
#define _T2CON_T2CKPS0_LENGTH                    0x00000001

#define _T2CON_T2CKPS1_POSITION                  0x00000001
#define _T2CON_T2CKPS1_MASK                      0x00000002
#define _T2CON_T2CKPS1_LENGTH                    0x00000001

#define _T2CON_T2OUTPS0_POSITION                 0x00000003
#define _T2CON_T2OUTPS0_MASK                     0x00000008
#define _T2CON_T2OUTPS0_LENGTH                   0x00000001

#define _T2CON_T2OUTPS1_POSITION                 0x00000004
#define _T2CON_T2OUTPS1_MASK                     0x00000010
#define _T2CON_T2OUTPS1_LENGTH                   0x00000001

#define _T2CON_T2OUTPS2_POSITION                 0x00000005
#define _T2CON_T2OUTPS2_MASK                     0x00000020
#define _T2CON_T2OUTPS2_LENGTH                   0x00000001

#define _T2CON_T2OUTPS3_POSITION                 0x00000006
#define _T2CON_T2OUTPS3_MASK                     0x00000040
#define _T2CON_T2OUTPS3_LENGTH                   0x00000001

#define _T3GCON_T3GSS_POSITION                   0x00000000
#define _T3GCON_T3GSS_MASK                       0x00000003
#define _T3GCON_T3GSS_LENGTH                     0x00000002

#define _T3GCON_T3GVAL_POSITION                  0x00000002
#define _T3GCON_T3GVAL_MASK                      0x00000004
#define _T3GCON_T3GVAL_LENGTH                    0x00000001

#define _T3GCON_T3GGO_POSITION                   0x00000003
#define _T3GCON_T3GGO_MASK                       0x00000008
#define _T3GCON_T3GGO_LENGTH                     0x00000001

#define _T3GCON_T3GSPM_POSITION                  0x00000004
#define _T3GCON_T3GSPM_MASK                      0x00000010
#define _T3GCON_T3GSPM_LENGTH                    0x00000001

#define _T3GCON_T3GTM_POSITION                   0x00000005
#define _T3GCON_T3GTM_MASK                       0x00000020
#define _T3GCON_T3GTM_LENGTH                     0x00000001

#define _T3GCON_T3GPOL_POSITION                  0x00000006
#define _T3GCON_T3GPOL_MASK                      0x00000040
#define _T3GCON_T3GPOL_LENGTH                    0x00000001

#define _T3GCON_TMR3GE_POSITION                  0x00000007
#define _T3GCON_TMR3GE_MASK                      0x00000080
#define _T3GCON_TMR3GE_LENGTH                    0x00000001

#define _T3GCON_T3GSS0_POSITION                  0x00000000
#define _T3GCON_T3GSS0_MASK                      0x00000001
#define _T3GCON_T3GSS0_LENGTH                    0x00000001

#define _T3GCON_T3GSS1_POSITION                  0x00000001
#define _T3GCON_T3GSS1_MASK                      0x00000002
#define _T3GCON_T3GSS1_LENGTH                    0x00000001

#define _T3GCON_NOT_T3DONE_POSITION              0x00000003
#define _T3GCON_NOT_T3DONE_MASK                  0x00000008
#define _T3GCON_NOT_T3DONE_LENGTH                0x00000001

#define _T3GCON_TGSS_POSITION                    0x00000000
#define _T3GCON_TGSS_MASK                        0x00000003
#define _T3GCON_TGSS_LENGTH                      0x00000002

#define _T3GCON_TGVAL_POSITION                   0x00000002
#define _T3GCON_TGVAL_MASK                       0x00000004
#define _T3GCON_TGVAL_LENGTH                     0x00000001

#define _T3GCON_TGGO_POSITION                    0x00000003
#define _T3GCON_TGGO_MASK                        0x00000008
#define _T3GCON_TGGO_LENGTH                      0x00000001

#define _T3GCON_TGSE_POSITION                    0x00000004
#define _T3GCON_TGSE_MASK                        0x00000010
#define _T3GCON_TGSE_LENGTH                      0x00000001

#define _T3GCON_TGTM_POSITION                    0x00000005
#define _T3GCON_TGTM_MASK                        0x00000020
#define _T3GCON_TGTM_LENGTH                      0x00000001

#define _T3GCON_TGPOL_POSITION                   0x00000006
#define _T3GCON_TGPOL_MASK                       0x00000040
#define _T3GCON_TGPOL_LENGTH                     0x00000001

#define _T3GCON_TGATE_POSITION                   0x00000007
#define _T3GCON_TGATE_MASK                       0x00000080
#define _T3GCON_TGATE_LENGTH                     0x00000001

#define _T3CON_TMR3ON_POSITION                   0x00000000
#define _T3CON_TMR3ON_MASK                       0x00000001
#define _T3CON_TMR3ON_LENGTH                     0x00000001

#define _T3CON_NOT_T3SYNC_POSITION               0x00000002
#define _T3CON_NOT_T3SYNC_MASK                   0x00000004
#define _T3CON_NOT_T3SYNC_LENGTH                 0x00000001

#define _T3CON_T3OSCEN_POSITION                  0x00000003
#define _T3CON_T3OSCEN_MASK                      0x00000008
#define _T3CON_T3OSCEN_LENGTH                    0x00000001

#define _T3CON_T3CKPS_POSITION                   0x00000004
#define _T3CON_T3CKPS_MASK                       0x00000030
#define _T3CON_T3CKPS_LENGTH                     0x00000002

