MikroElektronika/core_packages/dsPIC/XC16/def/PIC24F08KL402/mcu.h
extern __attribute__((space(prog))) __prog__ uint16_t _FGS;
#define _FGS(x) __attribute__((address(0xf80004),deprecated_definition("consider migrating to #pragma config"),section("__FGS.sec"),space(prog))) __prog__ uint16_t _FGS = (x);

/*
** Only one invocation of FGS should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FGS.
** Multiple options may be combined, as shown:
**
** _FGS( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   General Segment Flash Write Protect:
**     GWRP_ON              General segment is write-protected
**     GWRP_OFF             General segment may be written
**
**   General Segment Code Protect:
**     GSS0_ON              Standard security enabled
**     GSS0_OFF             No Protection
**
*/

#define GWRP_ON              0x0002
#define GWRP_OFF             0x0003

#define GSS0_ON              0x0001
#define GSS0_OFF             0x0003

/* Register FOSCSEL (0xf80006)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FOSCSEL;
#define _FOSCSEL(x) __attribute__((address(0xf80006),deprecated_definition("consider migrating to #pragma config"),section("__FOSCSEL.sec"),space(prog))) __prog__ uint16_t _FOSCSEL = (x);

/*
** Only one invocation of FOSCSEL should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FOSCSEL.
** Multiple options may be combined, as shown:
**
** _FOSCSEL( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Oscillator Select:
**     FNOSC_FRC            Fast RC Oscillator (FRC)
**     FNOSC_FRCPLL         Fast RC Oscillator with Postscaler and PLL (FRCDIV+PLL)
**     FNOSC_PRI            Primary Oscillator (XT, HS, EC)
**     FNOSC_PRIPLL         Primary Oscillator with PLL (XT+PLL, HS+PLL, EC+PLL)
**     FNOSC_SOSC           Secondary Oscillator (SOSC)
**     FNOSC_LPRC           Low Power RC Oscillator (LPRC)
**     FNOSC_LPFRC          500KHz Low Power FRC with Postscaler (LPFRC)
**     FNOSC_FRCDIV         8MHz FRC with Postscaler (FRCDIV)
**
**   SOSC Source Type:
**     SOSCSRC_DIG          Digital Mode for use with external clock on SCLKI
**     SOSCSRC_ANA          Analog Mode for use with crystal
**
**   LPRC Power and Accuracy:
**     LPRCSEL_LP           Low Power/Low Accuracy
**     LPRCSEL_HP           High Power/High Accuracy
**
**   Internal External Switch Over bit:
**     IESO_OFF             Internal External Switchover mode disabled (Two-speed Start-up disabled)
**     IESO_ON              Internal External Switchover mode enabled (Two-speed Start-up enabled)
**
*/

#define FNOSC_FRC            0x00E0
#define FNOSC_FRCPLL         0x00E1
#define FNOSC_PRI            0x00E2
#define FNOSC_PRIPLL         0x00E3
#define FNOSC_SOSC           0x00E4
#define FNOSC_LPRC           0x00E5
#define FNOSC_LPFRC          0x00E6
#define FNOSC_FRCDIV         0x00E7

#define SOSCSRC_DIG          0x00C7
#define SOSCSRC_ANA          0x00E7

#define LPRCSEL_LP           0x00A7
#define LPRCSEL_HP           0x00E7

#define IESO_OFF             0x0067
#define IESO_ON              0x00E7

/* Register FOSC (0xf80008)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FOSC;
#define _FOSC(x) __attribute__((address(0xf80008),deprecated_definition("consider migrating to #pragma config"),section("__FOSC.sec"),space(prog))) __prog__ uint16_t _FOSC = (x);

/*
** Only one invocation of FOSC should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FOSC.
** Multiple options may be combined, as shown:
**
** _FOSC( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Primary Oscillator Mode:
**     POSCMD_EC            External clock mode selected
**     POSCMD_XT            XT oscillator mode selected
**     POSCMD_HS            HS oscillator mode selected
**     POSCMD_NONE          Primary oscillator disabled
**
**   CLKO Pin I/O Function:
**     OSCIOFNC_ON          Port I/O enabled (CLKO disabled)
**     OSCIOFNC_OFF         CLKO output signal enabled
**
**   Primary Oscillator Frequency Range:
**     POSCFREQ_LS          Primary Oscillator/External Clock frequency <100kHz
**     POSCFREQ_MS          Primary Oscillator/External Clock frequency between 100kHz to 8MHz
**     POSCFREQ_HS          Primary Oscillator/External Clock frequency >8MHz
**
**   SOSC Power Selection Configuration bits:
**     SOSCSEL_SOSCLP       Secondary Oscillator configured for low-power operation
**     SOSCSEL_SOSCHP       Secondary Oscillator configured for high-power operation
**
**   Clock Switching and Monitor Selection:
**     FCKSM_CSECME         Clock Switching and Fail-safe Clock Monitor Enabled
**     FCKSM_CSECMD         Clock Switching Enabled; Fail-safe Clock Monitor Disabled
**     FCKSM_CSDCMD         Clock Switching and Fail-safe Clock Monitor Disabled
**
*/

#define POSCMD_EC            0x00FC
#define POSCMD_XT            0x00FD
#define POSCMD_HS            0x00FE
#define POSCMD_NONE          0x00FF

#define OSCIOFNC_ON          0x00FB
#define OSCIOFNC_OFF         0x00FF

#define POSCFREQ_LS          0x00EF
#define POSCFREQ_MS          0x00F7
#define POSCFREQ_HS          0x00FF

#define SOSCSEL_SOSCLP       0x00DF
#define SOSCSEL_SOSCHP       0x00FF

#define FCKSM_CSECME         0x003F
#define FCKSM_CSECMD         0x007F
#define FCKSM_CSDCMD         0x00FF

/* Register FWDT (0xf8000a)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FWDT;
#define _FWDT(x) __attribute__((address(0xf8000a),deprecated_definition("consider migrating to #pragma config"),section("__FWDT.sec"),space(prog))) __prog__ uint16_t _FWDT = (x);

/*
** Only one invocation of FWDT should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FWDT.
** Multiple options may be combined, as shown:
**
** _FWDT( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Watchdog Timer Postscale Select bits:
**     WDTPS_PS1            1:1
**     WDTPS_PS2            1:2
**     WDTPS_PS4            1:4
**     WDTPS_PS8            1:8
**     WDTPS_PS16           1:16
**     WDTPS_PS32           1:32
**     WDTPS_PS64           1:64
**     WDTPS_PS128          1:128
**     WDTPS_PS256          1:256
**     WDTPS_PS512          1:512
**     WDTPS_PS1024         1:1024
**     WDTPS_PS2048         1:2048
**     WDTPS_PS4096         1:4096
**     WDTPS_PS8192         1:8192
**     WDTPS_PS16384        1:16384
**     WDTPS_PS32768        1:32768
**
**   WDT Prescaler bit:
**     FWPSA_PR32           WDT prescaler ratio of 1:32
**     FWPSA_PR128          WDT prescaler ratio of 1:128
**
**   Watchdog Timer Enable bits:
**     FWDTEN_OFF           WDT disabled in hardware; SWDTEN bit disabled
**     FWDTEN_NOSLP         WDT enabled while device is active; SWDTEN bit disabled
**     FWDTEN_SWON          WDT controlled with SWDTEN bit setting
**     FWDTEN_ON            WDT enabled in hardware
**
**   Windowed Watchdog Timer Disable bit:
**     WINDIS_ON            Windowed WDT enabled
**     WINDIS_OFF           Standard WDT selected (windowed WDT disabled)
**
*/

#define WDTPS_PS1            0x00F0
#define WDTPS_PS2            0x00F1
#define WDTPS_PS4            0x00F2
#define WDTPS_PS8            0x00F3
#define WDTPS_PS16           0x00F4
#define WDTPS_PS32           0x00F5
#define WDTPS_PS64           0x00F6
#define WDTPS_PS128          0x00F7
#define WDTPS_PS256          0x00F8
#define WDTPS_PS512          0x00F9
#define WDTPS_PS1024         0x00FA
#define WDTPS_PS2048         0x00FB
#define WDTPS_PS4096         0x00FC
#define WDTPS_PS8192         0x00FD
#define WDTPS_PS16384        0x00FE
#define WDTPS_PS32768        0x00FF

#define FWPSA_PR32           0x00EF
#define FWPSA_PR128          0x00FF

#define FWDTEN_OFF           0x005F
#define FWDTEN_NOSLP         0x007F
#define FWDTEN_SWON          0x00DF
#define FWDTEN_ON            0x00FF

